// Методи і властивості різних типів даних.

// Стрічка
// var str = "John Doe";
// var length = str.length;
//
// // збережеться довжина змінної str
// console.log(length);


// // str.toUpperCase()
// var str2 = "itea";
// //виведе str2 в верхньому регістрі
// //Важливо -- метод toUpperCase не міняє змінну, а просто повертає значення в верхньому регістрі
// console.log(str2.toUpperCase());
//
// console.log(str2); // значення лишилося "itea"
//
// // щоб зберегти значення в верхньому регістрі, потрібно просто результат присвоїти змінній
// var res = str2.toUpperCase();
// console.log(res);
//
//
// // Щоб отримати значення певного символу стрічки, потрібно звернутися до нього через []
//
// var str3 = "IvanoFrankivsk";
//
// // виведе першу букву, бо рахунок починається з нуля.
// console.log(str3[0]); // I
//
// // якщо звертатися до символу, якого немає, поверне undefined
// console.log(str3[100]); //undefined



// // пошук слова в слові
// var str = "lala1Tlala2";
//
// // метод indeoOf() повертає порядковий номер букви чи слова, якщо воно є. якщо немає , повертає -1
// var result = str.indexOf("T");
// console.log(result);  // поверне 5, бо буква T на 5 позиції(якщо рахувати з нуля)
//
//
// var result2 = str.indexOf("A");
// console.log(result2);// поверне -1, бо букви А немає взагалі в змінній str.




//task
// написати код, який буде робити наступне
// є змінна(стрічка) приблизно така
// var price = "100$";

// потрібно вивести на екран(console.log чи alert()) вартість без $
// якщо юзер ввів просто число, то вивести це число
// якщо ввів з доларом, вивести число без долара
// але код повинен працювати якщо я введу 200$ чи 500$
//
//
// алгоритм приблизно наступний
// питаємся суму (prompt()) , якщо в змінній є число(тип данних Number), то виводимо те, що юзер ввів(якщо число, то це означає що юзер ввів суму без $)
// якщо що юзер ввів стрічку, значить він ввів суму зі знаком долару. виводимо число без знаку долара.
// код має працювати якщо ввести 100$ і 10000$
// тут потрібно логічно подумати як вивести число без долара
