// конвертер валют
// ми можемо конвертувати 3 валюти
// доллари, євро,фунти
// в перший інпут вводимо сумму і валюту
// доллари - d
// євро - e
// фунти - f
// наприклад
// 100e
// 200d
// 300f
//
// і хай курс буде наступний
// 1 доллар = 26 грн
// 1 євро = 31 грн
// 1 фунт = 35грн
//
// в змінну result зберегти сумму в гривні
// тобто треба ввести наприклад 100d
// і в змінній result має зберегтися значення 2500(без букв, тільки число)
//
// значення інпуту в змінній input1
document.getElementById("btn").onclick = function () {
  var input1 = document.getElementById("input1").value;
  // тут код
  //зберегти результат в змінну result
  var result; 

  document.getElementById("input2").value = result;
}
