// GIT
git add
git commit
git pull
git push
git checkout


// рекурсія
// в тілі функції викликається ця ж функція.


// піднесення до степеня



pow(2,4) = 2 * pow(2,3);
pow(2,3) = 2 * pow(2,2);
pow(2,2) = 2 * pow(2,1);
pow(2,1) = 2 * pow(2,0);
pow(2,0) = 1;

// в рекурсії повинна бути умова виходу з функці
// інакше буде виконуватися вічно

// в даному випадку умова виходу якщо(степінь < 1)
// і повернути 1


//task

// написати функцію, яка приймає 2 параметри
// перший це число, другий це степінь
// функція повинна повернути число в степені.
// написати через цикл і через рекурсію
