// написати функцію, яка приймає масив обєктів
var users = [
    {
      name: "John",
      salary: 300,
      age: 25
    },
    {
      name: "Steve",
      salary: 1100,
      age: 25
    },
    {
      name: "Steve",
      salary: 2000,
      age: 25
    },
    {
      name: "Steve",
      salary: 600,
      age: 25
    }
  ]
  
  // в кого зарплата більше 1000,
  // додати тому юзеру властивість isRich = true
  // в кого менше 1000, isRich = false
  
  
  // повернути модифікований массив
  
  function func(arr){
    
  }
  
  console.log(func(users));























// GIT
// git add
// git commit
// git pull
// git push
// git checkout


// рекурсія
// в тілі функції викликається ця ж функція.


// піднесення до степеня



pow(2,4) = 2 * pow(2,3);
pow(2,3) = 2 * pow(2,2);
pow(2,2) = 2 * pow(2,1);
pow(2,1) = 2 * pow(2,0);
pow(2,0) = 1;

// в рекурсії повинна бути умова виходу з функці
// інакше буде виконуватися вічно

// в даному випадку умова виходу якщо(степінь < 1)
// і повернути 1


// приклад
const countDownFrom = (num) => {
    if(num === 0) {
        return;
    }
    console.log(num);
    countDownFrom(num - 1);
}
// виведе
// 10
// 9
// 8
// 7
// ...
// 1


//task

// написати функцію, яка приймає 2 параметри
// перший це число, другий це степінь
// функція повинна повернути число в степені.
// написати через цикл і через рекурсію
