// пишемо функцію калькулятор
// функція приймає одну стрічку
// наприклад
var str1 = "23+5";
// і повертає 28
var str2 = "2*230";
// і поверне 460
// я вибрав такий алгоритм
// перебрати всі елементи стрічки
// і привести їх до числа

// памятаємо що 0 при приведенні до логічног типу
// повертає false, a 1 - true

// якщо один з елементів не приводиться,
// це і є операція (+,-,*,/)
// треба присвоїти любій змінній операцію
// і далі ...


function func(str){

}

console.log(func(str1));
console.log(func(str2));


//tasks/task6.js
